Revit 2027 API
WallpaintFinishType Enumeration
 The enumerated type representing the permitted values for the asset property "WallpaintFinish" from the "WallPaint" schema.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum WallpaintFinishType
Public Enumeration WallpaintFinishType
public enum class WallpaintFinishType
type WallpaintFinishType
Members
Member name | Value | Description
Eggshell | 1
Flat | 0
Gloss | 5
Pearl | 3
Platinum | 2
Semigloss | 4
See Also
Reference
Autodesk.Revit.DB.Visual Namespace